In [84]:
import pandas as pd
import numpy as np
import matplotlib as ple

In [85]:
data = pd.read_csv('dataset_banco.csv')

In [86]:
data.info

<bound method DataFrame.info of        age           job   marital  education default  balance housing loan  \
0       58    management   married   tertiary      no   2143.0     yes   no
1       44    technician    single  secondary      no     29.0     yes   no
2       33  entrepreneur   married  secondary      no      2.0     yes  yes
3       47   blue-collar   married    unknown      no   1506.0     yes   no
4       33       unknown    single    unknown      no      1.0      no   no
...    ...           ...       ...        ...     ...      ...     ...  ...
45210   51    technician   married   tertiary      no    825.0      no   no
45211   71       retired  divorced    primary      no   1729.0      no   no
45212   72       retired   married  secondary      no   5715.0      no   no
45213   57   blue-collar   married  secondary      no    668.0      no   no
45214   37  entrepreneur   married  secondary      no   2971.0      no   no

         contact  day month  duration  campaign  pdays  previous poutcome    y
0        unknown    5   may     261.0         1   -1.0         0  unknown   no
1        unknown    5   may     151.0         1   -1.0         0  unknown   no
2        unknown    5   may      76.0         1   -1.0         0  unknown   no
3        unknown    5   may      92.0         1   -1.0         0  unknown   no
4        unknown    5   may     198.0         1   -1.0         0  unknown   no
...          ...  ...   ...       ...       ...    ...       ...      ...  ...
45210   cellular   17   nov     977.0         3   -1.0         0  unknown  yes
45211   cellular   17   nov     456.0         2   -1.0         0  unknown  yes
45212   cellular   17   nov    1127.0         5  184.0         3  success  yes
45213  telephone   17   nov     508.0         4   -1.0         0  unknown   no
45214   cellular   17   nov     361.0         2  188.0        11    other   no

[45215 rows x 17 columns]>

In [87]:
data.isnull().sum()

age          0
job          2
marital      1
education    1
default      0
balance      2
housing      0
loan         0
contact      0
day          0
month        0
duration     1
campaign     0
pdays        1
previous     0
poutcome     0
y            0
dtype: int64

In [88]:
# from pandas_profiling import ProfileReport
from ydata_profiling import ProfileReport

report = ProfileReport(data)
report.to_file(output_file='reporte.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

c:\Users\Sena\AppData\Local\Programs\Python\Python312\Lib\site-packages\ydata_profiling\model\correlations.py:66: UserWarning: There was an attempt to calculate the auto correlation, but this failed.
To hide this warning, disable the calculation
(using `df.profile_report(correlations={"auto": {"calculate": False}})`
If this is problematic for your use case, please report this as an issue:
https://github.com/ydataai/ydata-profiling/issues
(include the error message: 'could not convert string to float: 'unknown'')
  warnings.warn(

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

In [89]:
data.dropna(inplace=True)

In [90]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45207 entries, 0 to 45214
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45207 non-null  int64
 1   job        45207 non-null  object
 2   marital    45207 non-null  object
 3   education  45207 non-null  object
 4   default    45207 non-null  object
 5   balance    45207 non-null  float64
 6   housing    45207 non-null  object
 7   loan       45207 non-null  object
 8   contact    45207 non-null  object
 9   day        45207 non-null  int64
 10  month      45207 non-null  object
 11  duration   45207 non-null  float64
 12  campaign   45207 non-null  int64
 13  pdays      45207 non-null  float64
 14  previous   45207 non-null  int64
 15  poutcome   45207 non-null  object
 16  y          45207 non-null  object
dtypes: float64(3), int64(4), object(10)
memory usage: 6.2+ MB

In [91]:
data.drop(columns='duration')

,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143.0,yes,no,unknown,5,may,1,-1.0,0,unknown,no
1,44,technician,single,secondary,no,29.0,yes,no,unknown,5,may,1,-1.0,0,unknown,no
2,33,entrepreneur,married,secondary,no,2.0,yes,yes,unknown,5,may,1,-1.0,0,unknown,no
3,47,blue-collar,married,unknown,no,1506.0,yes,no,unknown,5,may,1,-1.0,0,unknown,no
4,33,unknown,single,unknown,no,1.0,no,no,unknown,5,may,1,-1.0,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45210,51,technician,married,tertiary,no,825.0,no,no,cellular,17,nov,3,-1.0,0,unknown,yes
45211,71,retired,divorced,primary,no,1729.0,no,no,cellular,17,nov,2,-1.0,0,unknown,yes
45212,72,retired,married,secondary,no,5715.0,no,no,cellular,17,nov,5,184.0,3,success,yes
45213,57,blue-collar,married,secondary,no,668.0,no,no,telephone,17,nov,4,-1.0,0,unknown,no
45214,37,entrepreneur,married,secondary,no,2971.0,no,no,cellular,17,nov,2,188.0,11,other,no

In [92]:
data=data.drop(columns='duration')

In [93]:
data=data.drop(columns='campaign')
data=data.drop(columns='pdays')

In [94]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45207 entries, 0 to 45214
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45207 non-null  int64
 1   job        45207 non-null  object
 2   marital    45207 non-null  object
 3   education  45207 non-null  object
 4   default    45207 non-null  object
 5   balance    45207 non-null  float64
 6   housing    45207 non-null  object
 7   loan       45207 non-null  object
 8   contact    45207 non-null  object
 9   day        45207 non-null  int64
 10  month      45207 non-null  object
 11  previous   45207 non-null  int64
 12  poutcome   45207 non-null  object
 13  y          45207 non-null  object
dtypes: float64(1), int64(3), object(10)
memory usage: 5.2+ MB

In [95]:
data.drop_duplicates(inplace=True)
data.shape

(45151, 14)

In [96]:
import seaborn as sns
import matplotlib.pyplot as plt

# Generar gráficas individuales pues las variables numéricas
# están en rangos diferentes
cols_num = ['age', 'balance', 'day', 'previous']

fig, ax = plt.subplots(nrows=4, ncols=1, figsize=(8,30))
fig.subplots_adjust(hspace=0.5)

for i, col in enumerate(cols_num):
    sns.boxplot(x=col, data=data, ax=ax[i])
    ax[i].set_title(col)

In [97]:
data.describe()

                age        balance           day      previous
count  45151.000000   45151.000000  45151.000000  45151.000000
mean      41.009103    1375.466169     15.800292      0.580807
std       12.040371    3925.836929      8.322341      2.304586
min       18.000000   -8019.000000      1.000000      0.000000
25%       33.000000      73.000000      8.000000      0.000000
50%       39.000000     450.000000     16.000000      0.000000
75%       48.000000    1429.500000     21.000000      0.000000
max      776.000000  527532.000000     31.000000    275.000000

In [98]:
data[data['age'] > 100]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,previous,poutcome,y
229,530,services,divorced,secondary,no,1467.0,yes,no,unknown,5,may,0,unknown,no
1076,490,services,single,primary,no,114.0,yes,no,unknown,7,may,0,unknown,no
2229,123,student,single,tertiary,no,250.0,yes,no,unknown,12,may,0,unknown,no
3018,332,admin.,single,secondary,no,91.0,yes,no,unknown,14,may,0,unknown,no
5799,311,self-employed,single,secondary,no,360.0,yes,no,unknown,26,may,0,unknown,no
6053,399,blue-collar,married,primary,no,2805.0,yes,no,unknown,26,may,0,unknown,no
28152,466,blue-collar,married,secondary,no,120.0,yes,yes,cellular,29,jan,3,failure,no
43530,776,retired,married,secondary,no,820.0,no,no,telephone,23,apr,0,unknown,yes

In [99]:
data=data[data['age'] <100]

data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45143 entries, 0 to 45214
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45143 non-null  int64
 1   job        45143 non-null  object
 2   marital    45143 non-null  object
 3   education  45143 non-null  object
 4   default    45143 non-null  object
 5   balance    45143 non-null  float64
 6   housing    45143 non-null  object
 7   loan       45143 non-null  object
 8   contact    45143 non-null  object
 9   day        45143 non-null  int64
 10  month      45143 non-null  object
 11  previous   45143 non-null  int64
 12  poutcome   45143 non-null  object
 13  y          45143 non-null  object
dtypes: float64(1), int64(3), object(10)
memory usage: 5.2+ MB

In [100]:
data[data['previous'] > 200]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,previous,poutcome,y
29184,40,management,married,tertiary,no,543.0,yes,no,cellular,2,feb,275,other,no

In [101]:
data=data.drop(index=29184)

In [102]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45142 entries, 0 to 45214
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45142 non-null  int64
 1   job        45142 non-null  object
 2   marital    45142 non-null  object
 3   education  45142 non-null  object
 4   default    45142 non-null  object
 5   balance    45142 non-null  float64
 6   housing    45142 non-null  object
 7   loan       45142 non-null  object
 8   contact    45142 non-null  object
 9   day        45142 non-null  int64
 10  month      45142 non-null  object
 11  previous   45142 non-null  int64
 12  poutcome   45142 non-null  object
 13  y          45142 non-null  object
dtypes: float64(1), int64(3), object(10)
memory usage: 5.2+ MB

In [103]:
data['marital'].unique()

array(['married', 'single', 'div.', 'divorced', 'DIVORCED', 'Single'],
      dtype=object)

In [104]:
data['marital']=data['marital'].str.replace('div.','divorced', regex=False)

data['marital']=data['marital'].str.replace('DIVORCED','divorced', regex=False)

data['marital']=data['marital'].str.replace('Single','single', regex=False)

In [105]:
data['job'].unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'Management', 'retired', 'admin.', 'services',
       'self-employed', 'MANAGEMENT', 'Self-employed', 'unemployed',
       'housemaid', 'student', 'Services', 'Retired', 'administrative'],
      dtype=object)

In [106]:
data['job'] = data['job'].str.replace('Management', 'management', regex=False)
data['job'] = data['job'].str.replace('MANAGEMENT', 'management', regex=False)

data['job'] = data['job'].str.replace('admin.', 'administrative', regex=False)

data['job'] = data['job'].str.replace('Services.', 'services', regex=False)

data['job'] = data['job'].str.replace('Self-employed', 'self-employed', regex=False)

data['job'] = data['job'].str.replace('Retired', 'retired', regex=False)

In [107]:
data['job'].unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'administrative', 'services',
       'self-employed', 'unemployed', 'housemaid', 'student', 'Services'],
      dtype=object)

In [108]:
data['education'].unique()

array(['tertiary', 'secondary', 'unknown', 'primary', 'SECONDARY',
       'Secondary', 'Primary', 'sec.', 'Tertiary', 'UNK'], dtype=object)

In [109]:
data['education'] = data['education'].str.replace('Secondary', 'secondary', regex=False)
data['education'] = data['education'].str.replace('SECONDARY', 'secondary', regex=False)
data['education'] = data['education'].str.replace('sec.', 'secondary', regex=False)

data['education'] = data['education'].str.replace('Primary', 'primary', regex=False)

data['education'] = data['education'].str.replace('Tertiary', 'tertiary', regex=False)

data['education'] = data['education'].str.replace('UNK', 'unknown', regex=False)

In [110]:
data['education'].unique()

array(['tertiary', 'secondary', 'unknown', 'primary'], dtype=object)

In [111]:
data['contact'].unique()

array(['unknown', 'cellular', 'telephone', 'phone', 'mobile'],
      dtype=object)

In [112]:
data['contact'] = data['contact'].str.replace('phone', 'telephone', regex=False)
data['contact'] = data['contact'].str.replace('mobile', 'cellular', regex=False)

In [113]:
data['contact'] = data['contact'].str.replace('teletelephone', 'telephone', regex=False)

In [114]:
data['contact'].unique()

array(['unknown', 'cellular', 'telephone'], dtype=object)

In [115]:
data['month'].unique()

array(['may', 'nov', 'jun', 'jul', 'aug', 'oct', 'dec', 'jan', 'feb',
       'mar', 'apr', 'sep'], dtype=object)

In [116]:
data['poutcome'].unique()

array(['unknown', 'UNK', 'failure', 'other', 'success', 'Success'],
      dtype=object)

In [117]:
data['poutcome'] = data['poutcome'].str.replace('UNK', 'unknown', regex=False)

data['poutcome'] = data['poutcome'].str.replace('Success', 'success', regex=False)

In [118]:
data['poutcome'].unique()

array(['unknown', 'failure', 'other', 'success'], dtype=object)

In [119]:
data.to_csv('datos_banco136.csv')